app/Controllers/Dashboard.php

    public function index()
    {
        if (!session()->has('logged_in') || !session()->get('user_name')) {
            return redirect()->to('/login')->with('error', 'Please log in to access the dashboard.');
        }

        $userid = session()->get('user_id');
        $userModel = new Users();
        $data['res'] = $userModel->find($userid);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '3'